*Note:* [Pandas_Cheat_Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)

In [0]:
#Upload a file to my Google Drive. (I'm using Google Colab.)
from google.colab import files
uploaded = files.upload()

Saving train.csv to train.csv

In [0]:
#And run this cell to make another cell(s) work properly.
import numpy as np
import pandas as pd
import io

**Quiz1**

โหลด csv เข้าไปใน Python Pandas

In [2]:
#Quiz1

df = pd.read_csv('https://gist.githubusercontent.com/deen666/aaf734fe721ca1bf504d324bf76eef04/raw/8f990dffacaf13cff911a86d4bc944be3b0d0486/train.csv') #Use the local filepath or url link to read or fetch the .csv file.
#df = pd.read_csv(io.BytesIO(uploaded['train.csv']))  #I'm using the uploaded .csv file on my GDrive.
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**Quiz2**

เขียนโค้ดแสดง หัว10แถว ท้าย10แถว และสุ่ม10แถว

In [0]:
#Quiz2
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [0]:
#Quiz2
df.tail(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[10 rows x 12 columns]

In [0]:
#Quiz2
df.sample(10)

     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
863          864         0       3  ...   69.5500          NaN         S
573          574         1       3  ...    7.7500          NaN         Q
379          380         0       3  ...    7.7750          NaN         S
660          661         1       1  ...  133.6500          NaN         S
582          583         0       2  ...   26.0000          NaN         S
341          342         1       1  ...  263.0000  C23 C25 C27         S
110          111         0       1  ...   52.0000         C110         S
566          567         0       3  ...    7.8958          NaN         S
97            98         1       1  ...   63.3583      D10 D12         C
348          349         1       3  ...   15.9000          NaN         S

[10 rows x 12 columns]

**Quiz3**

ลบ row ที่มี Embarked ว่าง

In [0]:
#Quiz3
df2 = df.dropna(subset=['Embarked'])
print(df2)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]

**Quiz4**

เติม age ด้วยค่าเฉลี่ย

In [0]:
#Quiz4
avg = df2['Age'].mean()
print(avg)

df3 = df2.copy() #https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
df3['Age'].fillna(value = avg, inplace=True)
df3

29.64209269662921

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]

**Quiz5**

เติม age ด้วย 0

In [0]:
#Quiz5
df4 = df2.copy()
df4['Age'].fillna(value = 0, inplace=True)
df4

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]

**Quiz6**

ลบ row ที่ age เป็นค่าว่าง

In [0]:
#Quiz6 
df.dropna(subset=['Age'], inplace=True)
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[714 rows x 12 columns]

**Quiz7**

หาจำนวนผู้หญิงต่อผู้ชายที่อยู่บนเรือ

In [0]:
ori_df = pd.read_csv('https://gist.githubusercontent.com/deen666/aaf734fe721ca1bf504d324bf76eef04/raw/8f990dffacaf13cff911a86d4bc944be3b0d0486/train.csv')   #Original Data Frame 
ori_df['Sex'].value_counts()  

#ori_df['Sex'].unique()  #Find the unique or distinct name in columm Sex.

male      577
female    314
Name: Sex, dtype: int64

In [0]:

cleaning_df = df.copy()
cleaning_df['Sex'].value_counts() #DataFrame from Quiz6 (with data cleaning.)

male      453
female    261
Name: Sex, dtype: int64

In [0]:
#Quiz 7
F = (ori_df['Sex'] == 'female').sum()
M = (ori_df['Sex'] == 'male').sum()
ratio = F/M
print(ratio)

0.5441941074523396

**Quiz8**

หาจำนวนผู้หญิงและผู้ชายที่รอดชีวิต

	Survived (1) or died (0)*

In [0]:
#Quiz8 

survived_group = ori_df.groupby(['Sex'])['Survived'].sum()
print (survived_group)

Sex
female    233
male      109
Name: Survived, dtype: int64

**Quiz9**

หา % การรอดชีวิตของผู้หญิงและผู้ชาย

In [0]:
#Quiz9
#(required variable from quiz7)
#total_group = ori_df.groupby(['Sex'])['Survived'].count()
#survived_group = ori_df.groupby(['Sex'])['Survived'].sum()

SF = ((ori_df['Survived'] == 1) & (ori_df['Sex'] == 'female')).sum()
SM = ((ori_df['Survived'] == 1) & (ori_df['Sex'] == 'male')).sum()

print('Survival Rate (Female) =',SF/F*100)
print('Survival Rate (Male) =',SM/M*100)

Survivors Rate (Female) = 74.20382165605095
Survivors Rate (Male) = 18.890814558058924

**Quiz10**

แปลงคอลัมน์ female = 0 และ male = 1

In [0]:
#Run this cell first for Quiz10-22
df = pd.read_csv('https://gist.githubusercontent.com/deen666/aaf734fe721ca1bf504d324bf76eef04/raw/8f990dffacaf13cff911a86d4bc944be3b0d0486/train.csv')   #Original Data Frame

In [0]:
#Quiz10
df['Sex'].replace(['female','male'],[0,1], inplace=True)
df

     PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0              1         0       3  ...   7.2500    NaN         S
1              2         1       1  ...  71.2833    C85         C
2              3         1       3  ...   7.9250    NaN         S
3              4         1       1  ...  53.1000   C123         S
4              5         0       3  ...   8.0500    NaN         S
..           ...       ...     ...  ...      ...    ...       ...
886          887         0       2  ...  13.0000    NaN         S
887          888         1       1  ...  30.0000    B42         S
888          889         0       3  ...  23.4500    NaN         S
889          890         1       1  ...  30.0000   C148         C
890          891         0       3  ...   7.7500    NaN         Q

[891 rows x 12 columns]

**Quiz11**

หาคนที่อายุมากที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน

In [0]:
#Quiz11
#df['Age'] == df['Age'].max()  find max of age in boolean
df[df['Age'] == df['Age'].max()][['Name','Age','Embarked']]

                                     Name   Age Embarked
630  Barkworth, Mr. Algernon Henry Wilson  80.0        S

**Quiz12**

หาคนที่อายุน้อยที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน

In [0]:
#Quiz12
df[df['Age'] == df['Age'].min()][['Name','Age','Embarked']]

                                Name   Age Embarked
803  Thomas, Master. Assad Alexander  0.42        C

**Quiz13**

หาคนที่จ่ายค่าโดยสารแพงที่สุดพร้อมบอกชื่อ อายุ และรอดชีวิตไหม

In [0]:
#Quiz13
df[df['Fare'] == df['Fare'].max()][['Name','Fare','Age','Survived']]

                                   Name      Fare   Age  Survived
258                    Ward, Miss. Anna  512.3292  35.0         1
679  Cardeza, Mr. Thomas Drake Martinez  512.3292  36.0         1
737              Lesurer, Mr. Gustave J  512.3292  35.0         1

**Quiz14**

หาคนที่จ่ายค่าโดยสารถูกที่สุดพร้อมบอกชื่อ อายุ และรอดชีวิตไหม

In [0]:
#Quiz14
df[df['Fare'] == df['Fare'].min()][['Name','Fare','Age','Survived']]

                                 Name  Fare   Age  Survived
179               Leonard, Mr. Lionel   0.0  36.0         0
263             Harrison, Mr. William   0.0  40.0         0
271      Tornquist, Mr. William Henry   0.0  25.0         1
277       Parkes, Mr. Francis "Frank"   0.0   NaN         0
302   Johnson, Mr. William Cahoone Jr   0.0  19.0         0
413    Cunningham, Mr. Alfred Fleming   0.0   NaN         0
466             Campbell, Mr. William   0.0   NaN         0
481  Frost, Mr. Anthony Wood "Archie"   0.0   NaN         0
597               Johnson, Mr. Alfred   0.0  49.0         0
633     Parr, Mr. William Henry Marsh   0.0   NaN         0
674        Watson, Mr. Ennis Hastings   0.0   NaN         0
732              Knight, Mr. Robert J   0.0   NaN         0
806            Andrews, Mr. Thomas Jr   0.0  39.0         0
815                  Fry, Mr. Richard   0.0   NaN         0
822   Reuchlin, Jonkheer. John George   0.0  38.0         0

**Quiz15**

สรุปว่ามีคนนั่งตั๋ว 1 2 3 กี่คน

In [0]:
#Quiz15
df.groupby(['Pclass'])['Fare'].count()

Pclass
1    216
2    184
3    491
Name: Fare, dtype: int64

In [0]:
#Quiz15
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

**Quiz16**

หาค่าเฉลี่ยของตั๋วโดยสารแบบที่นั่งชั้น 1 2 3

In [0]:
#Quiz16
df.groupby('Pclass').agg({'Fare':'mean'})

             Fare
Pclass
1       84.154687
2       20.662183
3       13.675550

**Quiz17**

มีผู้โดยสารกี่คนที่อายุเกิน 50 แล้วรอดชีวิต

In [0]:
#Quiz17
((df['Age'] > 50) & (df['Survived'] == 1)).sum()

22

**Quiz18**

แสดงผลข้อมูลทั้งหมดของที่นั่งชั้น 1 2 3 (describe)

In [0]:
#Quzi18
df.groupby(['Pclass']).describe()

       PassengerId                          ...     Fare
             count        mean         std  ...      50%   75%       max
Pclass                                      ...
1            216.0  461.597222  246.737616  ...  60.2875  93.5  512.3292
2            184.0  445.956522  250.852161  ...  14.2500  26.0   73.5000
3            491.0  439.154786  264.441453  ...   8.0500  15.5   69.5500

[3 rows x 56 columns]

**Quiz19**

แสดงผลตั๋วที่แพงที่สุดของที่นั่งแต่ละชั้น

In [0]:
#Quiz19
df.groupby(['Pclass'])['Fare'].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

**Quiz20**

แสดงเป็นกลุ่มช่วงอายุ 0-10, 20-30 …. (เพิ่มทีละ10) และหาว่าแต่ละกลุ่มมีอัตราการรอดชีวิตเท่าไหร่

In [0]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 8 columns]

In [0]:
#Quiz20

#df['Age_group'] = pd.cut(df.Age, range(0, 81, 10))
#print(df['Age_group'])

age_labels = ['0-10', '10-20', '20-30', '30-40', '40-50', '50-60', '60-70', '70-80']
df['Age_group'] = pd.cut(df.Age, range(0, 81, 10), labels=age_labels)


print('Survival Rate by',df.groupby(['Age_group'])['Survived'].mean()*100)

#print('Survival Rate by',df.groupby(['Age_group']).agg({'Survived':'mean'})

Survival Rate by Age_group
0-10     59.375000
10-20    38.260870
20-30    36.521739
30-40    44.516129
40-50    38.372093
50-60    40.476190
60-70    23.529412
70-80    20.000000
Name: Survived, dtype: float64

**Quiz21**

เรียงลำดับตามราคามากไปน้อย และน้อยไปมาก

In [0]:
#Quiz21
print('Sort fare BY DESC\n',df.sort_values('Fare')[::-1])
print('Sort fare BY ASC\n',df.sort_values('Fare')[::1])

Sort fare BY DESC
      PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
679          680         1       1  ...  512.3292  B51 B53 B55         C
258          259         1       1  ...  512.3292          NaN         C
737          738         1       1  ...  512.3292         B101         C
341          342         1       1  ...  263.0000  C23 C25 C27         S
438          439         0       1  ...  263.0000  C23 C25 C27         S
..           ...       ...     ...  ...       ...          ...       ...
277          278         0       2  ...    0.0000          NaN         S
633          634         0       1  ...    0.0000          NaN         S
302          303         0       3  ...    0.0000          NaN         S
597          598         0       3  ...    0.0000          NaN         S
271          272         1       3  ...    0.0000          NaN         S

[891 rows x 12 columns]
Sort fare BY ASC
      PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
271          272         1       3  ...    0.0000          NaN         S
597          598         0       3  ...    0.0000          NaN         S
302          303         0       3  ...    0.0000          NaN         S
633          634         0       1  ...    0.0000          NaN         S
277          278         0       2  ...    0.0000          NaN         S
..           ...       ...     ...  ...       ...          ...       ...
438          439         0       1  ...  263.0000  C23 C25 C27         S
341          342         1       1  ...  263.0000  C23 C25 C27         S
737          738         1       1  ...  512.3292         B101         C
258          259         1       1  ...  512.3292          NaN         C
679          680         1       1  ...  512.3292  B51 B53 B55         C

[891 rows x 12 columns]

**Quiz22**

หานามสกุลที่ซ้ำกัน และแต่ละนามสกุลที่ซ้ำกันซ้ำกันกี่คน

In [3]:
#Quiz22 

#df.head()


SurName = df['Name'].str.split(',', expand=True)  #split https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.split.html
Dup = SurName[0].value_counts() 
print(Dup[Dup > 1])

#SurName[0].duplicated().value_counts()

Andersson               9
Sage                    7
Panula                  6
Goodwin                 6
Johnson                 6
                       ..
Mellinger               2
Penasco y Castellana    2
Coutts                  2
Coleff                  2
Larsson                 2
Name: 0, Length: 133, dtype: int64

**Quiz23**

แสดงผลนามสกุลที่ไม่มีการซ้ำกันเลย และนับว่ามีกี่นามสกุล

In [0]:
#Quiz23

NotDup = SurName[0].value_counts() 
print(NotDup[NotDup == 1])

NotDup.value_counts()

Gilnagh           1
Laleff            1
Weisz             1
Peduzzi           1
Ling              1
                 ..
Leitch            1
Padro y Manent    1
Wilhelms          1
Bailey            1
Denkoff           1
Name: 0, Length: 534, dtype: int64

1    534
Name: 0, dtype: int64

In [7]:
#Quiz23

SurName[0].unique()
SurName[0].nunique()

667